LuoYaoSheng/smart-hid-workspace/smart-hid-firmware/sdkconfig.defaults
# Smart HID Firmware — 默认 sdkconfig（仅列 Smart HID 相关与关键覆盖项）
# 完整配置由 `idf.py menuconfig` / `idf.py build` 生成。

# === Target ===
CONFIG_IDF_TARGET="esp32s3"

# === Flash Size（ESP32-S3 常见 8MB flash；partition 表需 factory+ota_0+ota_1 共 3MB+）===
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# === Partition Table ===
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# === USB TinyUSB ===
# Composite HID（Keyboard + Mouse）
# esp_tinyusb managed component（main/idf_component.yml 拉取）。
# 启用 2 个 HID interface（keyboard + mouse），CFG_TUD_HID 由它驱动。
CONFIG_TINYUSB_HID_COUNT=2

# === FreeRTOS ===
CONFIG_FREERTOS_HZ=1000

# === LWIP / MQTT ===
CONFIG_MQTT_TASK_STACK_SIZE=6144

# === NVS Encryption ===
# F4 才启用，F1/F2 保持默认（无加密）
# CONFIG_NVS_ENCRYPTION=y

# === Compiler（M1-G3：BLE+HTTP 组件使固件超 1M，启用 -Os） ===
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# === Logging ===
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# === PSRAM（ESP32-S3-N8R2 模组） ===
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# === BLE Provisioning（M1-G3，NimBLE） ===
# 选型：NimBLE（体积 ~Bluedroid 1/3、ESP-IDF 官方维护、peripheral-only 足够）。
# 安全：bonding + LE Secure Connections（Just Works——无 IO 能力，非 MITM 抗性，
# 见 protocols/ble/PROVISIONING_V1.md Security 节）。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
